Revit 2024 API
DividedSurface.ComponentRotation Property
The rotation of the pattern by a multiple of 90 degrees.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ComponentRotation ComponentRotation { get; set; }
Visual Basic
Public Property ComponentRotation As ComponentRotation
	Get
	Set
Visual C++
public:
property ComponentRotation ComponentRotation {
	ComponentRotation get ();
	void set (ComponentRotation value);
}
Remarks
This property has no effect unless a pattern is selected (the ObjectType property is not null).
See Also
DividedSurface Class
Autodesk.Revit.DB Namespace